In [0]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

In [2]:
from google.colab import drive
drive.mount('/content/drive')

Go to this URL in a browser: https://accounts.google.com/o/oauth2/auth?client_id=947318989803-6bn6qk8qdgf4n4g3pfee6491hc0brc4i.apps.googleusercontent.com&redirect_uri=urn%3Aietf%3Awg%3Aoauth%3A2.0%3Aoob&scope=email%20https%3A%2F%2Fwww.googleapis.com%2Fauth%2Fdocs.test%20https%3A%2F%2Fwww.googleapis.com%2Fauth%2Fdrive%20https%3A%2F%2Fwww.googleapis.com%2Fauth%2Fdrive.photos.readonly%20https%3A%2F%2Fwww.googleapis.com%2Fauth%2Fpeopleapi.readonly&response_type=code

Enter your authorization code:
··········
Mounted at /content/drive

In [3]:
bank_data = pd.read_csv('/content/drive/My Drive/AIML_NoteBooks/LabAndAssignments/R7/Churn_Modelling.csv');
bank_data.head()

   RowNumber  CustomerId   Surname  ...  IsActiveMember EstimatedSalary Exited
0          1    15634602  Hargrave  ...               1       101348.88      1
1          2    15647311      Hill  ...               1       112542.58      0
2          3    15619304      Onio  ...               0       113931.57      1
3          4    15701354      Boni  ...               0        93826.63      0
4          5    15737888  Mitchell  ...               1        79084.10      0

[5 rows x 14 columns]

In [4]:
#include relevant columns within x and y
x = bank_data.iloc[:, 3:13]
y = bank_data.iloc[:, 13]
bank_data.head()

   RowNumber  CustomerId   Surname  ...  IsActiveMember EstimatedSalary Exited
0          1    15634602  Hargrave  ...               1       101348.88      1
1          2    15647311      Hill  ...               1       112542.58      0
2          3    15619304      Onio  ...               0       113931.57      1
3          4    15701354      Boni  ...               0        93826.63      0
4          5    15737888  Mitchell  ...               1        79084.10      0

[5 rows x 14 columns]

Applying encoder on Geography and Gender.

In [5]:
from sklearn.preprocessing import LabelEncoder

labelencoder_x = LabelEncoder()
x.iloc[:, 1] = labelencoder_x.fit_transform(x.iloc[:, 1])
x.head()

   CreditScore  Geography  Gender  ...  HasCrCard  IsActiveMember  EstimatedSalary
0          619          0  Female  ...          1               1        101348.88
1          608          2  Female  ...          0               1        112542.58
2          502          0  Female  ...          1               0        113931.57
3          699          0  Female  ...          0               0         93826.63
4          850          2  Female  ...          1               1         79084.10

[5 rows x 10 columns]

In [6]:

labelencoder_x_2 = LabelEncoder()
x.iloc[:, 2] = labelencoder_x_2.fit_transform(x.iloc[:, 2])
x.head()

   CreditScore  Geography  Gender  ...  HasCrCard  IsActiveMember  EstimatedSalary
0          619          0       0  ...          1               1        101348.88
1          608          2       0  ...          0               1        112542.58
2          502          0       0  ...          1               0        113931.57
3          699          0       0  ...          0               0         93826.63
4          850          2       0  ...          1               1         79084.10

[5 rows x 10 columns]

In [7]:
from keras.utils import to_categorical
encoded = pd.DataFrame(to_categorical(x.iloc[:, 1]))
x = pd.concat([encoded, x], axis = 1)
x.head()

Using TensorFlow backend.

     0    1    2  ...  HasCrCard  IsActiveMember  EstimatedSalary
0  1.0  0.0  0.0  ...          1               1        101348.88
1  0.0  0.0  1.0  ...          0               1        112542.58
2  1.0  0.0  0.0  ...          1               0        113931.57
3  1.0  0.0  0.0  ...          0               0         93826.63
4  0.0  0.0  1.0  ...          1               1         79084.10

[5 rows x 13 columns]

In [8]:
x = x.drop(['Geography', 0], axis = 1)
x.head()

     1    2  CreditScore  ...  HasCrCard  IsActiveMember  EstimatedSalary
0  0.0  0.0          619  ...          1               1        101348.88
1  0.0  1.0          608  ...          0               1        112542.58
2  0.0  0.0          502  ...          1               0        113931.57
3  0.0  0.0          699  ...          0               0         93826.63
4  0.0  1.0          850  ...          1               1         79084.10

[5 rows x 11 columns]

In [0]:
from sklearn.model_selection import train_test_split
from sklearn.preprocessing import StandardScaler

X_train, X_test, Y_train, Y_test = train_test_split(x, y, test_size = 0.2, random_state = 0)
sc = StandardScaler()
X_train = sc.fit_transform(X_train)
X_test = sc.transform(X_test)

In [10]:
import keras
from keras.models import Sequential
from keras.layers import Dense

classifier = Sequential()
classifier.add(Dense(output_dim = 6, init = 'uniform', activation = 'relu', input_dim = 11))
classifier.add(Dense(output_dim = 6, init = 'uniform', activation = 'relu'))
classifier.add(Dense(output_dim = 1, init = 'uniform', activation = 'sigmoid'))
classifier.compile(optimizer = 'adam', loss = "binary_crossentropy", metrics = ['accuracy'])

WARNING: Logging before flag parsing goes to stderr.
W0901 13:18:07.210169 140556256237440 deprecation_wrapper.py:119] From /usr/local/lib/python3.6/dist-packages/keras/backend/tensorflow_backend.py:66: The name tf.get_default_graph is deprecated. Please use tf.compat.v1.get_default_graph instead.

/usr/local/lib/python3.6/dist-packages/ipykernel_launcher.py:6: UserWarning: Update your `Dense` call to the Keras 2 API: `Dense(activation="relu", input_dim=11, units=6, kernel_initializer="uniform")`

W0901 13:18:07.283805 140556256237440 deprecation_wrapper.py:119] From /usr/local/lib/python3.6/dist-packages/keras/backend/tensorflow_backend.py:541: The name tf.placeholder is deprecated. Please use tf.compat.v1.placeholder instead.

W0901 13:18:07.293326 140556256237440 deprecation_wrapper.py:119] From /usr/local/lib/python3.6/dist-packages/keras/backend/tensorflow_backend.py:4432: The name tf.random_uniform is deprecated. Please use tf.random.uniform instead.

/usr/local/lib/python3.6/dist-packages/ipykernel_launcher.py:7: UserWarning: Update your `Dense` call to the Keras 2 API: `Dense(activation="relu", units=6, kernel_initializer="uniform")`
  import sys
/usr/local/lib/python3.6/dist-packages/ipykernel_launcher.py:8: UserWarning: Update your `Dense` call to the Keras 2 API: `Dense(activation="sigmoid", units=1, kernel_initializer="uniform")`

W0901 13:18:07.344946 140556256237440 deprecation_wrapper.py:119] From /usr/local/lib/python3.6/dist-packages/keras/optimizers.py:793: The name tf.train.Optimizer is deprecated. Please use tf.compat.v1.train.Optimizer instead.

W0901 13:18:07.368890 140556256237440 deprecation_wrapper.py:119] From /usr/local/lib/python3.6/dist-packages/keras/backend/tensorflow_backend.py:3657: The name tf.log is deprecated. Please use tf.math.log instead.

W0901 13:18:07.376619 140556256237440 deprecation.py:323] From /usr/local/lib/python3.6/dist-packages/tensorflow/python/ops/nn_impl.py:180: add_dispatch_support.<locals>.wrapper (from tensorflow.python.ops.array_ops) is deprecated and will be removed in a future version.
Instructions for updating:
Use tf.where in 2.0, which has the same broadcast rule as np.where

**Training the model**

In [11]:
classifier.fit(X_train, Y_train, batch_size = 10, nb_epoch = 20)

/usr/local/lib/python3.6/dist-packages/ipykernel_launcher.py:1: UserWarning: The `nb_epoch` argument in `fit` has been renamed `epochs`.
  """Entry point for launching an IPython kernel.
W0901 13:18:11.668766 140556256237440 deprecation_wrapper.py:119] From /usr/local/lib/python3.6/dist-packages/keras/backend/tensorflow_backend.py:1033: The name tf.assign_add is deprecated. Please use tf.compat.v1.assign_add instead.

Epoch 1/20
8000/8000 [==============================] - 2s 212us/step - loss: 0.4707 - acc: 0.7960
Epoch 2/20
8000/8000 [==============================] - 1s 125us/step - loss: 0.4278 - acc: 0.7960
Epoch 3/20
8000/8000 [==============================] - 1s 126us/step - loss: 0.4218 - acc: 0.8056
Epoch 4/20
8000/8000 [==============================] - 1s 126us/step - loss: 0.4176 - acc: 0.8232
Epoch 5/20
8000/8000 [==============================] - 1s 126us/step - loss: 0.4159 - acc: 0.8272
Epoch 6/20
8000/8000 [==============================] - 1s 130us/step - loss: 0.4142 - acc: 0.8312
Epoch 7/20
8000/8000 [==============================] - 1s 126us/step - loss: 0.4124 - acc: 0.8311
Epoch 8/20
8000/8000 [==============================] - 1s 128us/step - loss: 0.4115 - acc: 0.8316
Epoch 9/20
8000/8000 [==============================] - 1s 127us/step - loss: 0.4105 - acc: 0.8317
Epoch 10/20
8000/8000 [==============================] - 1s 125us/step - loss: 0.4094 - acc: 0.8321
Epoch 11/20
8000/8000 [==============================] - 1s 127us/step - loss: 0.4086 - acc: 0.8321
Epoch 12/20
8000/8000 [==============================] - 1s 122us/step - loss: 0.4073 - acc: 0.8325
Epoch 13/20
8000/8000 [==============================] - 1s 126us/step - loss: 0.4067 - acc: 0.8312
Epoch 14/20
8000/8000 [==============================] - 1s 127us/step - loss: 0.4057 - acc: 0.8352
Epoch 15/20
8000/8000 [==============================] - 1s 123us/step - loss: 0.4061 - acc: 0.8330
Epoch 16/20
8000/8000 [==============================] - 1s 126us/step - loss: 0.4052 - acc: 0.8324
Epoch 17/20
8000/8000 [==============================] - 1s 137us/step - loss: 0.4053 - acc: 0.8337
Epoch 18/20
8000/8000 [==============================] - 1s 134us/step - loss: 0.4048 - acc: 0.8344
Epoch 19/20
8000/8000 [==============================] - 1s 136us/step - loss: 0.4043 - acc: 0.8336
Epoch 20/20
8000/8000 [==============================] - 1s 131us/step - loss: 0.4043 - acc: 0.8322

**Predicting the model**

In [12]:
y_pred = classifier.predict(X_test)
y_pred = (y_pred > 0.5) #to classify each probability into True or False

from sklearn.metrics import confusion_matrix
cm = confusion_matrix(Y_test, y_pred)
print (cm, '\n\n', y_pred[:5, :])

[[1542   53]
 [ 264  141]]

 [[False]
 [False]
 [False]
 [False]
 [False]]

**Printing Accuracy**

In [14]:
print ((1542 + 141)/2000)

0.8415